# Listas

In [2]:
import pandas as pd
pd.__version__

'1.1.3'

# !pip install --upgradepandas
# esto permite actualizar el pandas

In [3]:
# creacion de una serie de pandas
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#muestra los valores que contiene la serie de pandas recien creada
sr.values

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
# indica que esta serie empieza en el indice 0 y termina en el indice 5
sr.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
#muestra la forma que tiene la serie, en este caso 5 elementos
sr.shape

(5,)

In [7]:
# accedemos al elemento ubicado en la posicion 3
sr[3]

4

In [8]:
# si quiere acceder a los elementos ubicados en la posicion mencionada
sr[[0,4,2]]

0    1
4    5
2    3
dtype: int64

In [9]:
#permite asignarle un indice a cada elemento de forma personalizada
num_let = pd.Series([2,4,6,8,10], index=['A','B','C','D','E'])
num_let

A     2
B     4
C     6
D     8
E    10
dtype: int64

In [10]:
num_let[['C','E']]

C     6
E    10
dtype: int64

In [11]:
# para acceder desde un elemento hasta otro elemento (rango)
num_let['B':'E']

B     4
C     6
D     8
E    10
dtype: int64

# Diccionarios

In [12]:
#Creacion de un diccionario
dic_frutas = {'Manzana': 2.500, 'Pera': 800, 'Piña': 2000}
dic_frutas

{'Manzana': 2.5, 'Pera': 800, 'Piña': 2000}

In [13]:
# obtenemos las llaves de los valores de nuestro diccionario
dic_frutas.keys()

dict_keys(['Manzana', 'Pera', 'Piña'])

In [14]:
# obtener el valor de la llave Pera
dic_frutas['Pera']

800

In [15]:
#convertir un diccionario a una serie
pd.Series(dic_frutas)

Manzana       2.5
Pera        800.0
Piña       2000.0
dtype: float64

In [16]:
# defino nuevos indices a la serie
# agrega a la llave Uva con valor NaN, puesto a que no le definimos valor
sr_frutas = pd.Series(dic_frutas, index=['Manzana','Pera','Uva'])
sr_frutas

Manzana      2.5
Pera       800.0
Uva          NaN
dtype: float64

In [17]:
# para hallar elementos nulos --> marca verdadero donde esta el valor nulo
sr_frutas.isnull()

Manzana    False
Pera       False
Uva         True
dtype: bool

In [18]:
# para hallar elementos no nulos --> marca verdadero donde esta el valor no nulo
sr_frutas.notnull()

Manzana     True
Pera        True
Uva        False
dtype: bool

# Dataframes

In [19]:
dic_datos = {'carro':[500, 600, 700], 'moto':[350, 100, 900], 'bici':[280, 500, 400] }
dic_datos

{'carro': [500, 600, 700], 'moto': [350, 100, 900], 'bici': [280, 500, 400]}

In [20]:
# con el diccionario anterior creamos un Dataframe
df = pd.DataFrame(dic_datos)
df

   carro  moto  bici
0    500   350   280
1    600   100   500
2    700   900   400

In [21]:
import numpy as np

In [22]:
dic_alumnos = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dic_alumnos

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

In [23]:
# conversion de un diccionario a un dataframe
df_alumnos = pd.DataFrame(dic_alumnos)
df_alumnos

   edad   cm pais genero    Q1   Q2
0    10  115   co      M   5.0  7.0
1     9  110   mx      F  10.0  9.0
2    13  130   co      F   8.0  9.0
3    14  155   mx      M   NaN  8.0
4    12  125   mx      M   7.0  8.0
5    11  120   ch      M   8.0  8.0
6    12  125   ch      F   3.0  9.0

In [24]:
# modificamos el indice de cada valor
df_alumnos = pd.DataFrame(dic_alumnos, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df_alumnos

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [25]:
# conocemos el indice del df
df_alumnos.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [26]:
# conocemos las columnas del df
df_alumnos.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [27]:
# conocemos el valor que contiene cada fila del df
df_alumnos.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

In [28]:
# obtenemos una serie de un subconjunto del dataframe
df_alumnos['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [29]:
# obtenemos un subconjunto de varias columnas del df
df_alumnos[['edad', 'genero', 'Q2']]

          edad genero   Q2
ana         10      M  7.0
benito       9      F  9.0
camilo      13      F  9.0
daniel      14      M  8.0
erika       12      M  8.0
fabian      11      M  8.0
gabriela    12      F  9.0

In [30]:
#obtenemos una serie que solo trae los datos del indice que le especificamos
# loc permite traer datos atravez de sus indices y columnas
df_alumnos.loc['ana', ['edad', 'genero', 'Q2']]

edad      10
genero     M
Q2         7
Name: ana, dtype: object

In [31]:
#obtenemos un subconjunto que solo trae los datos de la lista de indice que le especificamos
df_alumnos.loc[['ana','erika'], ['edad', 'genero', 'Q2']]

       edad genero   Q2
ana      10      M  7.0
erika    12      M  8.0

In [32]:
df_alumnos.loc['daniel','Q1']

nan

In [35]:
# iloc permite traer los datos atravez de su pocision
df_alumnos.iloc[2,1]

130

In [37]:
df_alumnos.iloc[[2,4,5],[1,3]]

         cm genero
camilo  130      F
erika   125      M
fabian  120      M

In [40]:
# selecciono todas las  filas con las columns especificadas en la posicion 1,3
df_alumnos.iloc[:,[1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

In [43]:
# selecciono los alumnos que son mayores o igual a 12 años
df_alumnos[df_alumnos['edad'] >= 12]

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

In [45]:
# selecciono los alumnos que son mayores o igual a 12 años y sean mexicanos
df_alumnos[(df_alumnos['edad'] >= 12) & (df_alumnos['pais'] == 'mx')]

        edad   cm pais genero   Q1   Q2
daniel    14  155   mx      M  NaN  8.0
erika     12  125   mx      M  7.0  8.0

In [46]:
# otra forma de implementar una condicion sobre un dataframe
df_alumnos.query('edad>=12')

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

In [49]:
df_alumnos[df_alumnos['Q2'] >= df_alumnos['Q1']]

          edad   cm pais genero   Q1   Q2
ana         10  115   co      M  5.0  7.0
camilo      13  130   co      F  8.0  9.0
erika       12  125   mx      M  7.0  8.0
fabian      11  120   ch      M  8.0  8.0
gabriela    12  125   ch      F  3.0  9.0